import Foundation

/*
 N은 그보다 작거나 같은 제곱수의 합으로 나타낼 수 있다.
 제곱수 항의 최소 개수를 출력하자.
 */

//input
let n = Int(readLine()!)!
var dp = [Int](repeating: 0, count: n + 1)
for i in 1...n {
    dp[i] = i
    var j = 1
    while j * j <= i { //제곱수 체크. 나보다 큰 값이라면 사용하지 않음!
        dp[i] = min(dp[i], dp[i-j*j] + 1)
        j += 1
    }
}
print(dp[n])

//(1)1 -> 1^2
//(2)2 -> 1^2 + 1^2
//(3)3 -> 1^2 + 1^2 + 1^2
//(1)4 -> 2^2
//(2)5 -> 1^2 + 2^2
//(3)6 -> 1^2 + 1^2 + 2^2
//(4)7 -> 1^2 + 1^2 + 1^2 + 2^2
//(2)8 -> 2^2 + 2^2
//(1)9 -> 3^2
//(2)10 -> 1^2 + 3^2
//(3)11 -> 1^2 + 1^2 + 3^2
//(4)12 -> 1^2 + 1^2 + 1^2 + 3^2
//(2)13 -> 2^2 + 3^2
//(3)14 -> 1^2 + 2^2 + 3^2
//(4)15 -> 1^2 + 1^2 + 2^2 + 3^2
//(5)16 -> 1^2 + 1^2 + 1^2 + 2^2 + 3^2
//(3)27 -> 2^2 + 2^2 + 3^2
